backend/load-tests/scenarios.yml
config:
  target: "https://staging.glowverse.app"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 300
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up"
    
    # Sustained load
    - duration: 600
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load
    - duration: 300
      arrivalRate: 100
      name: "Peak load"
    
    # Cool-down
    - duration: 60
      arrivalRate: 10
      name: "Cool-down"
  
  plugins:
    metrics-by-endpoint:
      stripQueryString: true
      metricsNamespace: "glowverse_api"
  
  processor: "./helpers.js"
  
  http:
    timeout: 30
  
  variables:
    authToken: ""

scenarios:
  - name: "User Journey - Browse and Purchase"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test{{ $randomNumber(1, 1000) }}@example.com"
            password: "testpass123"
          capture:
            - json: "$.data.token"
              as: "authToken"
      
      - get:
          url: "/api/products?category=skincare"
          headers:
            Authorization: "Bearer {{ authToken }}"
          think: 2
      
      - get:
          url: "/api/products/{{ $randomString(24) }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          think: 3
      
      - post:
          url: "/api/cart/items"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            productId: "{{ $randomString(24) }}"
            quantity: "{{ $randomNumber(1, 3) }}"
          think: 1
      
      - get:
          url: "/api/cart"
          headers:
            Authorization: "Bearer {{ authToken }}"
          think: 2
      
      - post:
          url: "/api/orders"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            paymentMethod: "credit_card"
            shippingAddress:
              street: "123 Test St"
              city: "Test City"
              state: "TS"
              zipCode: "12345"
  
  - name: "Search and Browse"
    weight: 30
    flow:
      - get:
          url: "/api/search?q=moisturizer"
          think: 1
      
      - get:
          url: "/api/products?category=makeup&sort=rating"
          think: 2
      
      - get:
          url: "/api/guides?category=tutorial"
          think: 3
  
  - name: "Guide Engagement"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test{{ $randomNumber(1, 1000) }}@example.com"
            password: "testpass123"
          capture:
            - json: "$.data.token"
              as: "authToken"
      
      - get:
          url: "/api/guides"
          headers:
            Authorization: "Bearer {{ authToken }}"
          think: 2
      
      - get:
          url: "/api/guides/{{ $randomString(24) }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          think: 5
      
      - post:
          url: "/api/guides/{{ $randomString(24) }}/like"
          headers:
            Authorization: "Bearer {{ authToken }}"
          think: 1
      
      - post:
          url: "/api/guides/{{ $randomString(24) }}/bookmark"
          headers:
            Authorization: "Bearer {{ authToken }}"
  
  - name: "AR Try-On"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test{{ $randomNumber(1, 1000) }}@example.com"
            password: "testpass123"
          capture:
            - json: "$.data.token"
              as: "authToken"
      
      - post:
          url: "/api/tryon/analyze"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            imageUrl: "https://example.com/face.jpg"
            productId: "{{ $randomString(24) }}"
          think: 5